for i in 'STALKER':
    if i == 'L' or i == 'E':
        print(i, end='')
    else:
        print(i, end='. ')

#  есть вопрос как сократить эту запись "i == 'L' or i == 'E'"?  при большом количестве элементов она была бы не эфективной
# еще хотел бы тут оставить отзыв по прохождению курса, на данный момент все очень нравится, не смотря на то что, пока были разобраны простые темы, просмотр лекций не утомлял, не было скучно, так как иногда просматриваю курс с опозданием, то появляющиеся вопросы уже разобраны в тг чате, что тоже очень удобно) на этом этапе всем доволен и в предвкушении сложного и интересного материала!